Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.wk_config will be destroyed
  # (because proxmox_virtual_environment_file.wk_config is not in configuration)
- resource "proxmox_virtual_environment_file" "wk_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "backup-nas" -> null
      - file_name      = "k3s-worker.cloud-config.yaml" -> null
      - id             = "backup-nas:snippets/k3s-worker.cloud-config.yaml" -> null
      - node_name      = "prox2" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = <<-EOT
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-cp-worker
                  - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
            EOT -> null
          - file_name = "k3s-worker.cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_cp" {
        id                      = "500"
        name                    = "cp-polaris-0"
        tags                    = [
            "cp",
            "k8s",
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ agent {
          ~ enabled = false -> true
            # (3 unchanged attributes hidden)
        }

        # (7 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[1] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_cp" {
        id                      = "501"
        name                    = "cp-polaris-1"
        tags                    = [
            "cp",
            "k8s",
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ agent {
          ~ enabled = false -> true
            # (3 unchanged attributes hidden)
        }

        # (7 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[2] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_cp" {
        id                      = "502"
        name                    = "cp-polaris-2"
        tags                    = [
            "cp",
            "k8s",
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ agent {
          ~ enabled = false -> true
            # (3 unchanged attributes hidden)
        }

        # (7 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "550" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.120",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::e0e1:41ff:fece:1c11",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "E2:E1:41:CE:1C:11",
        ] -> (known after apply)
        name                    = "wk-polaris-0"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-550-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          - user_data_file_id = "backup-nas:snippets/k3s-worker.cloud-config.yaml" -> null # forces replacement
            # (1 unchanged attribute hidden)

          + user_account { # forces replacement
              + keys     = [ # forces replacement
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value) # forces replacement
              + username = "ubuntu" # forces replacement
            }

            # (1 unchanged block hidden)
        }

      ~ memory {
          ~ shared    = 512 -> 5125
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          ~ mac_address = "E2:E1:41:CE:1C:11" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-1"
      + network_interface_names = (known after apply)
      + node_name               = "prox2"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 551

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.121/32"
                  + gateway = "192.168.2.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated = 512
          + floating  = 0
          + shared    = 5125
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-2"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 552

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.122/32"
                  + gateway = "192.168.2.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated = 512
          + floating  = 0
          + shared    = 5125
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

Plan: 3 to add, 3 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b498d417ac9c:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 3 to add, 3 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`